app/Controllers/Auth.php

SELECT *
FROM "users"
WHERE "email" = 'admin@example.com'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $userModel = new UserModel();

        // Get POST data (email and password)
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Fetch user from the database
        $user = $userModel->where('email', $email)->first();