app/Controllers/ProjectController.php

    public function index()
    {
        $prj = new ProjectModel();
        $skills = $prj->findAll();
---
SELECT *
FROM "projects"

    public function save(){
        $data = $this->request->getJSON(true);
        $prj = new ProjectModel();
        $prj->insert($data);
---
INSERT INTO "projects" ("name", "description") VALUES ('admin@example.com', 'root')

    public function deleteSkill($id)
    {
        $prj = new ProjectModel();
        $prj->delete($id);  // Delete the skill
---
DELETE FROM "projects"
WHERE "id" IN ('1')