app/Controllers/SkillController.php

SELECT *
FROM "skills"
---
    public function index()
    {
        $skillModel = new SkillModel();
        $data['skills'] = $skillModel->findAll();  // Fetch all skills